app/controllers/flats_controller.rb

  def index
    @flats = params[:search] ? Flat.where('name LIKE ?', "%#{params[:search]}%") : Flat.all
---
SELECT "flats".* FROM "flats" WHERE (name LIKE '%dwed%')

  def create
    @flat = Flat.new(flat_params)

    if @flat.save
---
INSERT INTO "flats" ("name", "address", "description", "price_per_night", "number_of_guests", "created_at", "updated_at", "img_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def set_flat
    @flat = Flat.find(params[:id])
---
SELECT "flats".* FROM "flats" WHERE "flats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]